zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/component/eth.h
#define ETH_NSR_PCSLNK_Pos                    _UINT32_(0)                                          /* (ETH_NSR) PCS Link State Position */
#define ETH_NSR_PCSLNK_Msk                    (_UINT32_(0x1) << ETH_NSR_PCSLNK_Pos)                /* (ETH_NSR) PCS Link State Mask */
#define ETH_NSR_PCSLNK(value)                 (ETH_NSR_PCSLNK_Msk & (_UINT32_(value) << ETH_NSR_PCSLNK_Pos)) /* Assignment of value for PCSLNK in the ETH_NSR register */
#define ETH_NSR_MDIO_Pos                      _UINT32_(1)                                          /* (ETH_NSR) MDIO Input Status Position */
#define ETH_NSR_MDIO_Msk                      (_UINT32_(0x1) << ETH_NSR_MDIO_Pos)                  /* (ETH_NSR) MDIO Input Status Mask */
#define ETH_NSR_MDIO(value)                   (ETH_NSR_MDIO_Msk & (_UINT32_(value) << ETH_NSR_MDIO_Pos)) /* Assignment of value for MDIO in the ETH_NSR register */
#define ETH_NSR_IDLE_Pos                      _UINT32_(2)                                          /* (ETH_NSR) PHY Management Logic Idle Position */
#define ETH_NSR_IDLE_Msk                      (_UINT32_(0x1) << ETH_NSR_IDLE_Pos)                  /* (ETH_NSR) PHY Management Logic Idle Mask */
#define ETH_NSR_IDLE(value)                   (ETH_NSR_IDLE_Msk & (_UINT32_(value) << ETH_NSR_IDLE_Pos)) /* Assignment of value for IDLE in the ETH_NSR register */
#define ETH_NSR_MACFD_Pos                     _UINT32_(3)                                          /* (ETH_NSR) Auto-Negotiate Duplex Resolution Position */
#define ETH_NSR_MACFD_Msk                     (_UINT32_(0x1) << ETH_NSR_MACFD_Pos)                 /* (ETH_NSR) Auto-Negotiate Duplex Resolution Mask */
#define ETH_NSR_MACFD(value)                  (ETH_NSR_MACFD_Msk & (_UINT32_(value) << ETH_NSR_MACFD_Pos)) /* Assignment of value for MACFD in the ETH_NSR register */
#define ETH_NSR_MACPRX_Pos                    _UINT32_(4)                                          /* (ETH_NSR) PCS Auto-Negotiation Pause Receive Resolution Position */
#define ETH_NSR_MACPRX_Msk                    (_UINT32_(0x1) << ETH_NSR_MACPRX_Pos)                /* (ETH_NSR) PCS Auto-Negotiation Pause Receive Resolution Mask */
#define ETH_NSR_MACPRX(value)                 (ETH_NSR_MACPRX_Msk & (_UINT32_(value) << ETH_NSR_MACPRX_Pos)) /* Assignment of value for MACPRX in the ETH_NSR register */
#define ETH_NSR_MACPTX_Pos                    _UINT32_(5)                                          /* (ETH_NSR) PCS Auto-Negotiation Pause Transmit Resolution Position */
#define ETH_NSR_MACPTX_Msk                    (_UINT32_(0x1) << ETH_NSR_MACPTX_Pos)                /* (ETH_NSR) PCS Auto-Negotiation Pause Transmit Resolution Mask */
#define ETH_NSR_MACPTX(value)                 (ETH_NSR_MACPTX_Msk & (_UINT32_(value) << ETH_NSR_MACPTX_Pos)) /* Assignment of value for MACPTX in the ETH_NSR register */
#define ETH_NSR_NEGPCLK_Pos                   _UINT32_(6)                                          /* (ETH_NSR) PFC Priority Based Pause Negotiated Position */
#define ETH_NSR_NEGPCLK_Msk                   (_UINT32_(0x1) << ETH_NSR_NEGPCLK_Pos)               /* (ETH_NSR) PFC Priority Based Pause Negotiated Mask */
#define ETH_NSR_NEGPCLK(value)                (ETH_NSR_NEGPCLK_Msk & (_UINT32_(value) << ETH_NSR_NEGPCLK_Pos)) /* Assignment of value for NEGPCLK in the ETH_NSR register */
#define ETH_NSR_LPI_Pos                       _UINT32_(7)                                          /* (ETH_NSR) LPI Indication Position */
#define ETH_NSR_LPI_Msk                       (_UINT32_(0x1) << ETH_NSR_LPI_Pos)                   /* (ETH_NSR) LPI Indication Mask */
#define ETH_NSR_LPI(value)                    (ETH_NSR_LPI_Msk & (_UINT32_(value) << ETH_NSR_LPI_Pos)) /* Assignment of value for LPI in the ETH_NSR register */
#define ETH_NSR_Msk                           _UINT32_(0x000000FF)                                 /* (ETH_NSR) Register Mask  */


/* -------- ETH_UR : (ETH Offset: 0x100C) (R/W 32) User Register -------- */
#define ETH_UR_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_UR) User Register  Reset Value */

#define ETH_UR_MII_Pos                        _UINT32_(0)                                          /* (ETH_UR) MII Mode Position */
#define ETH_UR_MII_Msk                        (_UINT32_(0x1) << ETH_UR_MII_Pos)                    /* (ETH_UR) MII Mode Mask */
#define ETH_UR_MII(value)                     (ETH_UR_MII_Msk & (_UINT32_(value) << ETH_UR_MII_Pos)) /* Assignment of value for MII in the ETH_UR register */
#define ETH_UR_Msk                            _UINT32_(0x00000001)                                 /* (ETH_UR) Register Mask  */


/* -------- ETH_DCFGR : (ETH Offset: 0x1010) (R/W 32) DMA Configuration Register -------- */
#define ETH_DCFGR_RESETVALUE                  _UINT32_(0x20704)                                    /*  (ETH_DCFGR) DMA Configuration Register  Reset Value */

#define ETH_DCFGR_FBLDO_Pos                   _UINT32_(0)                                          /* (ETH_DCFGR) Fixed Burst Length for DMA Data Operations: Position */
#define ETH_DCFGR_FBLDO_Msk                   (_UINT32_(0x1F) << ETH_DCFGR_FBLDO_Pos)              /* (ETH_DCFGR) Fixed Burst Length for DMA Data Operations: Mask */
#define ETH_DCFGR_FBLDO(value)                (ETH_DCFGR_FBLDO_Msk & (_UINT32_(value) << ETH_DCFGR_FBLDO_Pos)) /* Assignment of value for FBLDO in the ETH_DCFGR register */
#define ETH_DCFGR_EHDS_Pos                    _UINT32_(5)                                          /* (ETH_DCFGR) Enable Header Data Splitting Position */
#define ETH_DCFGR_EHDS_Msk                    (_UINT32_(0x1) << ETH_DCFGR_EHDS_Pos)                /* (ETH_DCFGR) Enable Header Data Splitting Mask */
#define ETH_DCFGR_EHDS(value)                 (ETH_DCFGR_EHDS_Msk & (_UINT32_(value) << ETH_DCFGR_EHDS_Pos)) /* Assignment of value for EHDS in the ETH_DCFGR register */
#define ETH_DCFGR_ESMA_Pos                    _UINT32_(6)                                          /* (ETH_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Position */
#define ETH_DCFGR_ESMA_Msk                    (_UINT32_(0x1) << ETH_DCFGR_ESMA_Pos)                /* (ETH_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Mask */
#define ETH_DCFGR_ESMA(value)                 (ETH_DCFGR_ESMA_Msk & (_UINT32_(value) << ETH_DCFGR_ESMA_Pos)) /* Assignment of value for ESMA in the ETH_DCFGR register */
#define ETH_DCFGR_ESPA_Pos                    _UINT32_(7)                                          /* (ETH_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Position */
#define ETH_DCFGR_ESPA_Msk                    (_UINT32_(0x1) << ETH_DCFGR_ESPA_Pos)                /* (ETH_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Mask */
#define ETH_DCFGR_ESPA(value)                 (ETH_DCFGR_ESPA_Msk & (_UINT32_(value) << ETH_DCFGR_ESPA_Pos)) /* Assignment of value for ESPA in the ETH_DCFGR register */
#define ETH_DCFGR_RXBMS_Pos                   _UINT32_(8)                                          /* (ETH_DCFGR) Receiver Packet Buffer Memory Size Select Position */
#define ETH_DCFGR_RXBMS_Msk                   (_UINT32_(0x3) << ETH_DCFGR_RXBMS_Pos)               /* (ETH_DCFGR) Receiver Packet Buffer Memory Size Select Mask */
#define ETH_DCFGR_RXBMS(value)                (ETH_DCFGR_RXBMS_Msk & (_UINT32_(value) << ETH_DCFGR_RXBMS_Pos)) /* Assignment of value for RXBMS in the ETH_DCFGR register */
#define ETH_DCFGR_TXPBMS_Pos                  _UINT32_(10)                                         /* (ETH_DCFGR) Transmitter Packet Buffer Memory Size Select Position */
#define ETH_DCFGR_TXPBMS_Msk                  (_UINT32_(0x1) << ETH_DCFGR_TXPBMS_Pos)              /* (ETH_DCFGR) Transmitter Packet Buffer Memory Size Select Mask */
#define ETH_DCFGR_TXPBMS(value)               (ETH_DCFGR_TXPBMS_Msk & (_UINT32_(value) << ETH_DCFGR_TXPBMS_Pos)) /* Assignment of value for TXPBMS in the ETH_DCFGR register */
#define ETH_DCFGR_TXCOEN_Pos                  _UINT32_(11)                                         /* (ETH_DCFGR) Transmitter Checksum Generation Offload Enable Position */
#define ETH_DCFGR_TXCOEN_Msk                  (_UINT32_(0x1) << ETH_DCFGR_TXCOEN_Pos)              /* (ETH_DCFGR) Transmitter Checksum Generation Offload Enable Mask */
#define ETH_DCFGR_TXCOEN(value)               (ETH_DCFGR_TXCOEN_Msk & (_UINT32_(value) << ETH_DCFGR_TXCOEN_Pos)) /* Assignment of value for TXCOEN in the ETH_DCFGR register */
#define ETH_DCFGR_ILDB_Pos                    _UINT32_(12)                                         /* (ETH_DCFGR) Infinite Last Data Buffer Position */
#define ETH_DCFGR_ILDB_Msk                    (_UINT32_(0x1) << ETH_DCFGR_ILDB_Pos)                /* (ETH_DCFGR) Infinite Last Data Buffer Mask */
#define ETH_DCFGR_ILDB(value)                 (ETH_DCFGR_ILDB_Msk & (_UINT32_(value) << ETH_DCFGR_ILDB_Pos)) /* Assignment of value for ILDB in the ETH_DCFGR register */
#define ETH_DCFGR_DRBS_Pos                    _UINT32_(16)                                         /* (ETH_DCFGR) DMA Receive Buffer Size Position */
#define ETH_DCFGR_DRBS_Msk                    (_UINT32_(0xFF) << ETH_DCFGR_DRBS_Pos)               /* (ETH_DCFGR) DMA Receive Buffer Size Mask */
#define ETH_DCFGR_DRBS(value)                 (ETH_DCFGR_DRBS_Msk & (_UINT32_(value) << ETH_DCFGR_DRBS_Pos)) /* Assignment of value for DRBS in the ETH_DCFGR register */
#define ETH_DCFGR_DDRP_Pos                    _UINT32_(24)                                         /* (ETH_DCFGR) DMA Discard Receive Packets Position */
#define ETH_DCFGR_DDRP_Msk                    (_UINT32_(0x1) << ETH_DCFGR_DDRP_Pos)                /* (ETH_DCFGR) DMA Discard Receive Packets Mask */
#define ETH_DCFGR_DDRP(value)                 (ETH_DCFGR_DDRP_Msk & (_UINT32_(value) << ETH_DCFGR_DDRP_Pos)) /* Assignment of value for DDRP in the ETH_DCFGR register */
#define ETH_DCFGR_MLBRX_Pos                   _UINT32_(25)                                         /* (ETH_DCFGR) Force Max Length Burst Recieve Position */
#define ETH_DCFGR_MLBRX_Msk                   (_UINT32_(0x1) << ETH_DCFGR_MLBRX_Pos)               /* (ETH_DCFGR) Force Max Length Burst Recieve Mask */
#define ETH_DCFGR_MLBRX(value)                (ETH_DCFGR_MLBRX_Msk & (_UINT32_(value) << ETH_DCFGR_MLBRX_Pos)) /* Assignment of value for MLBRX in the ETH_DCFGR register */
#define ETH_DCFGR_MLBTX_Pos                   _UINT32_(26)                                         /* (ETH_DCFGR) Force Max Length Burst Transmit Position */
#define ETH_DCFGR_MLBTX_Msk                   (_UINT32_(0x1) << ETH_DCFGR_MLBTX_Pos)               /* (ETH_DCFGR) Force Max Length Burst Transmit Mask */
#define ETH_DCFGR_MLBTX(value)                (ETH_DCFGR_MLBTX_Msk & (_UINT32_(value) << ETH_DCFGR_MLBTX_Pos)) /* Assignment of value for MLBTX in the ETH_DCFGR register */
#define ETH_DCFGR_EBDRX_Pos                   _UINT32_(28)                                         /* (ETH_DCFGR) Extended RX BD Mode ENable Position */
#define ETH_DCFGR_EBDRX_Msk                   (_UINT32_(0x1) << ETH_DCFGR_EBDRX_Pos)               /* (ETH_DCFGR) Extended RX BD Mode ENable Mask */
#define ETH_DCFGR_EBDRX(value)                (ETH_DCFGR_EBDRX_Msk & (_UINT32_(value) << ETH_DCFGR_EBDRX_Pos)) /* Assignment of value for EBDRX in the ETH_DCFGR register */
#define ETH_DCFGR_EBDTX_Pos                   _UINT32_(29)                                         /* (ETH_DCFGR) Extended TX BD Mode ENable Position */
#define ETH_DCFGR_EBDTX_Msk                   (_UINT32_(0x1) << ETH_DCFGR_EBDTX_Pos)               /* (ETH_DCFGR) Extended TX BD Mode ENable Mask */
#define ETH_DCFGR_EBDTX(value)                (ETH_DCFGR_EBDTX_Msk & (_UINT32_(value) << ETH_DCFGR_EBDTX_Pos)) /* Assignment of value for EBDTX in the ETH_DCFGR register */
#define ETH_DCFGR_ADDBW_Pos                   _UINT32_(30)                                         /* (ETH_DCFGR) Address Bus Width Position */
#define ETH_DCFGR_ADDBW_Msk                   (_UINT32_(0x1) << ETH_DCFGR_ADDBW_Pos)               /* (ETH_DCFGR) Address Bus Width Mask */
#define ETH_DCFGR_ADDBW(value)                (ETH_DCFGR_ADDBW_Msk & (_UINT32_(value) << ETH_DCFGR_ADDBW_Pos)) /* Assignment of value for ADDBW in the ETH_DCFGR register */
#define ETH_DCFGR_Msk                         _UINT32_(0x77FF1FFF)                                 /* (ETH_DCFGR) Register Mask  */


/* -------- ETH_TSR : (ETH Offset: 0x1014) (R/W 32) Transmit Status Register -------- */
#define ETH_TSR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSR) Transmit Status Register  Reset Value */

#define ETH_TSR_UBR_Pos                       _UINT32_(0)                                          /* (ETH_TSR) Used Bit Read Position */
#define ETH_TSR_UBR_Msk                       (_UINT32_(0x1) << ETH_TSR_UBR_Pos)                   /* (ETH_TSR) Used Bit Read Mask */
#define ETH_TSR_UBR(value)                    (ETH_TSR_UBR_Msk & (_UINT32_(value) << ETH_TSR_UBR_Pos)) /* Assignment of value for UBR in the ETH_TSR register */
#define ETH_TSR_COL_Pos                       _UINT32_(1)                                          /* (ETH_TSR) Collision Occurred Position */
#define ETH_TSR_COL_Msk                       (_UINT32_(0x1) << ETH_TSR_COL_Pos)                   /* (ETH_TSR) Collision Occurred Mask */
#define ETH_TSR_COL(value)                    (ETH_TSR_COL_Msk & (_UINT32_(value) << ETH_TSR_COL_Pos)) /* Assignment of value for COL in the ETH_TSR register */
#define ETH_TSR_RLE_Pos                       _UINT32_(2)                                          /* (ETH_TSR) Retry Limit Exceeded Position */
#define ETH_TSR_RLE_Msk                       (_UINT32_(0x1) << ETH_TSR_RLE_Pos)                   /* (ETH_TSR) Retry Limit Exceeded Mask */
#define ETH_TSR_RLE(value)                    (ETH_TSR_RLE_Msk & (_UINT32_(value) << ETH_TSR_RLE_Pos)) /* Assignment of value for RLE in the ETH_TSR register */
#define ETH_TSR_TXGO_Pos                      _UINT32_(3)                                          /* (ETH_TSR) Transmit Go Position */
#define ETH_TSR_TXGO_Msk                      (_UINT32_(0x1) << ETH_TSR_TXGO_Pos)                  /* (ETH_TSR) Transmit Go Mask */
#define ETH_TSR_TXGO(value)                   (ETH_TSR_TXGO_Msk & (_UINT32_(value) << ETH_TSR_TXGO_Pos)) /* Assignment of value for TXGO in the ETH_TSR register */
#define ETH_TSR_TFC_Pos                       _UINT32_(4)                                          /* (ETH_TSR) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_TSR_TFC_Msk                       (_UINT32_(0x1) << ETH_TSR_TFC_Pos)                   /* (ETH_TSR) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_TSR_TFC(value)                    (ETH_TSR_TFC_Msk & (_UINT32_(value) << ETH_TSR_TFC_Pos)) /* Assignment of value for TFC in the ETH_TSR register */
#define ETH_TSR_TXCOMP_Pos                    _UINT32_(5)                                          /* (ETH_TSR) Transmit Complete Position */
#define ETH_TSR_TXCOMP_Msk                    (_UINT32_(0x1) << ETH_TSR_TXCOMP_Pos)                /* (ETH_TSR) Transmit Complete Mask */
#define ETH_TSR_TXCOMP(value)                 (ETH_TSR_TXCOMP_Msk & (_UINT32_(value) << ETH_TSR_TXCOMP_Pos)) /* Assignment of value for TXCOMP in the ETH_TSR register */
#define ETH_TSR_UND_Pos                       _UINT32_(6)                                          /* (ETH_TSR) Transmit Underrun Position */
#define ETH_TSR_UND_Msk                       (_UINT32_(0x1) << ETH_TSR_UND_Pos)                   /* (ETH_TSR) Transmit Underrun Mask */
#define ETH_TSR_UND(value)                    (ETH_TSR_UND_Msk & (_UINT32_(value) << ETH_TSR_UND_Pos)) /* Assignment of value for UND in the ETH_TSR register */
#define ETH_TSR_LCOL_Pos                      _UINT32_(7)                                          /* (ETH_TSR) Late Colision Occured Position */
#define ETH_TSR_LCOL_Msk                      (_UINT32_(0x1) << ETH_TSR_LCOL_Pos)                  /* (ETH_TSR) Late Colision Occured Mask */
#define ETH_TSR_LCOL(value)                   (ETH_TSR_LCOL_Msk & (_UINT32_(value) << ETH_TSR_LCOL_Pos)) /* Assignment of value for LCOL in the ETH_TSR register */
#define ETH_TSR_HRESP_Pos                     _UINT32_(8)                                          /* (ETH_TSR) HRESP Not OK Position */
#define ETH_TSR_HRESP_Msk                     (_UINT32_(0x1) << ETH_TSR_HRESP_Pos)                 /* (ETH_TSR) HRESP Not OK Mask */
#define ETH_TSR_HRESP(value)                  (ETH_TSR_HRESP_Msk & (_UINT32_(value) << ETH_TSR_HRESP_Pos)) /* Assignment of value for HRESP in the ETH_TSR register */
#define ETH_TSR_Msk                           _UINT32_(0x000001FF)                                 /* (ETH_TSR) Register Mask  */


/* -------- ETH_RBQB : (ETH Offset: 0x1018) (R/W 32) Receive Buffer Queue Base Address -------- */
#define ETH_RBQB_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_RBQB) Receive Buffer Queue Base Address  Reset Value */

