zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/component/eth.h
#define ETH_IER_MFS_Pos                       _UINT32_(0)                                          /* (ETH_IER) Management Frame Sent Position */
#define ETH_IER_MFS_Msk                       (_UINT32_(0x1) << ETH_IER_MFS_Pos)                   /* (ETH_IER) Management Frame Sent Mask */
#define ETH_IER_MFS(value)                    (ETH_IER_MFS_Msk & (_UINT32_(value) << ETH_IER_MFS_Pos)) /* Assignment of value for MFS in the ETH_IER register */
#define ETH_IER_RCOMP_Pos                     _UINT32_(1)                                          /* (ETH_IER) Receive Complete Position */
#define ETH_IER_RCOMP_Msk                     (_UINT32_(0x1) << ETH_IER_RCOMP_Pos)                 /* (ETH_IER) Receive Complete Mask */
#define ETH_IER_RCOMP(value)                  (ETH_IER_RCOMP_Msk & (_UINT32_(value) << ETH_IER_RCOMP_Pos)) /* Assignment of value for RCOMP in the ETH_IER register */
#define ETH_IER_RXUBR_Pos                     _UINT32_(2)                                          /* (ETH_IER) RX Used Bit Read Position */
#define ETH_IER_RXUBR_Msk                     (_UINT32_(0x1) << ETH_IER_RXUBR_Pos)                 /* (ETH_IER) RX Used Bit Read Mask */
#define ETH_IER_RXUBR(value)                  (ETH_IER_RXUBR_Msk & (_UINT32_(value) << ETH_IER_RXUBR_Pos)) /* Assignment of value for RXUBR in the ETH_IER register */
#define ETH_IER_TXUBR_Pos                     _UINT32_(3)                                          /* (ETH_IER) TX Used Bit Read Position */
#define ETH_IER_TXUBR_Msk                     (_UINT32_(0x1) << ETH_IER_TXUBR_Pos)                 /* (ETH_IER) TX Used Bit Read Mask */
#define ETH_IER_TXUBR(value)                  (ETH_IER_TXUBR_Msk & (_UINT32_(value) << ETH_IER_TXUBR_Pos)) /* Assignment of value for TXUBR in the ETH_IER register */
#define ETH_IER_TUR_Pos                       _UINT32_(4)                                          /* (ETH_IER) Transmit Underrun Position */
#define ETH_IER_TUR_Msk                       (_UINT32_(0x1) << ETH_IER_TUR_Pos)                   /* (ETH_IER) Transmit Underrun Mask */
#define ETH_IER_TUR(value)                    (ETH_IER_TUR_Msk & (_UINT32_(value) << ETH_IER_TUR_Pos)) /* Assignment of value for TUR in the ETH_IER register */
#define ETH_IER_RLEX_Pos                      _UINT32_(5)                                          /* (ETH_IER) Retry Limit Exceeded or Late Collision Position */
#define ETH_IER_RLEX_Msk                      (_UINT32_(0x1) << ETH_IER_RLEX_Pos)                  /* (ETH_IER) Retry Limit Exceeded or Late Collision Mask */
#define ETH_IER_RLEX(value)                   (ETH_IER_RLEX_Msk & (_UINT32_(value) << ETH_IER_RLEX_Pos)) /* Assignment of value for RLEX in the ETH_IER register */
#define ETH_IER_TFC_Pos                       _UINT32_(6)                                          /* (ETH_IER) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IER_TFC_Msk                       (_UINT32_(0x1) << ETH_IER_TFC_Pos)                   /* (ETH_IER) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IER_TFC(value)                    (ETH_IER_TFC_Msk & (_UINT32_(value) << ETH_IER_TFC_Pos)) /* Assignment of value for TFC in the ETH_IER register */
#define ETH_IER_TCOMP_Pos                     _UINT32_(7)                                          /* (ETH_IER) Transmit Complete Position */
#define ETH_IER_TCOMP_Msk                     (_UINT32_(0x1) << ETH_IER_TCOMP_Pos)                 /* (ETH_IER) Transmit Complete Mask */
#define ETH_IER_TCOMP(value)                  (ETH_IER_TCOMP_Msk & (_UINT32_(value) << ETH_IER_TCOMP_Pos)) /* Assignment of value for TCOMP in the ETH_IER register */
#define ETH_IER_LCH_Pos                       _UINT32_(9)                                          /* (ETH_IER) Link Change Position */
#define ETH_IER_LCH_Msk                       (_UINT32_(0x1) << ETH_IER_LCH_Pos)                   /* (ETH_IER) Link Change Mask */
#define ETH_IER_LCH(value)                    (ETH_IER_LCH_Msk & (_UINT32_(value) << ETH_IER_LCH_Pos)) /* Assignment of value for LCH in the ETH_IER register */
#define ETH_IER_ROVR_Pos                      _UINT32_(10)                                         /* (ETH_IER) Receive Overrun Position */
#define ETH_IER_ROVR_Msk                      (_UINT32_(0x1) << ETH_IER_ROVR_Pos)                  /* (ETH_IER) Receive Overrun Mask */
#define ETH_IER_ROVR(value)                   (ETH_IER_ROVR_Msk & (_UINT32_(value) << ETH_IER_ROVR_Pos)) /* Assignment of value for ROVR in the ETH_IER register */
#define ETH_IER_HRESP_Pos                     _UINT32_(11)                                         /* (ETH_IER) HRESP Not OK Position */
#define ETH_IER_HRESP_Msk                     (_UINT32_(0x1) << ETH_IER_HRESP_Pos)                 /* (ETH_IER) HRESP Not OK Mask */
#define ETH_IER_HRESP(value)                  (ETH_IER_HRESP_Msk & (_UINT32_(value) << ETH_IER_HRESP_Pos)) /* Assignment of value for HRESP in the ETH_IER register */
#define ETH_IER_PFNZ_Pos                      _UINT32_(12)                                         /* (ETH_IER) Pause Frame with Non-zero Pause Quantum Received Position */
#define ETH_IER_PFNZ_Msk                      (_UINT32_(0x1) << ETH_IER_PFNZ_Pos)                  /* (ETH_IER) Pause Frame with Non-zero Pause Quantum Received Mask */
#define ETH_IER_PFNZ(value)                   (ETH_IER_PFNZ_Msk & (_UINT32_(value) << ETH_IER_PFNZ_Pos)) /* Assignment of value for PFNZ in the ETH_IER register */
#define ETH_IER_PTZ_Pos                       _UINT32_(13)                                         /* (ETH_IER) Pause Time Zero Position */
#define ETH_IER_PTZ_Msk                       (_UINT32_(0x1) << ETH_IER_PTZ_Pos)                   /* (ETH_IER) Pause Time Zero Mask */
#define ETH_IER_PTZ(value)                    (ETH_IER_PTZ_Msk & (_UINT32_(value) << ETH_IER_PTZ_Pos)) /* Assignment of value for PTZ in the ETH_IER register */
#define ETH_IER_PFTR_Pos                      _UINT32_(14)                                         /* (ETH_IER) Pause Frame Transmitted Position */
#define ETH_IER_PFTR_Msk                      (_UINT32_(0x1) << ETH_IER_PFTR_Pos)                  /* (ETH_IER) Pause Frame Transmitted Mask */
#define ETH_IER_PFTR(value)                   (ETH_IER_PFTR_Msk & (_UINT32_(value) << ETH_IER_PFTR_Pos)) /* Assignment of value for PFTR in the ETH_IER register */
#define ETH_IER_EXINT_Pos                     _UINT32_(15)                                         /* (ETH_IER) External Interrupt Position */
#define ETH_IER_EXINT_Msk                     (_UINT32_(0x1) << ETH_IER_EXINT_Pos)                 /* (ETH_IER) External Interrupt Mask */
#define ETH_IER_EXINT(value)                  (ETH_IER_EXINT_Msk & (_UINT32_(value) << ETH_IER_EXINT_Pos)) /* Assignment of value for EXINT in the ETH_IER register */
#define ETH_IER_ANEG_Pos                      _UINT32_(16)                                         /* (ETH_IER) PCS Auto-Negotiation Complete Position */
#define ETH_IER_ANEG_Msk                      (_UINT32_(0x1) << ETH_IER_ANEG_Pos)                  /* (ETH_IER) PCS Auto-Negotiation Complete Mask */
#define ETH_IER_ANEG(value)                   (ETH_IER_ANEG_Msk & (_UINT32_(value) << ETH_IER_ANEG_Pos)) /* Assignment of value for ANEG in the ETH_IER register */
#define ETH_IER_LPPRX_Pos                     _UINT32_(17)                                         /* (ETH_IER) PCS Link Partner Page Received Position */
#define ETH_IER_LPPRX_Msk                     (_UINT32_(0x1) << ETH_IER_LPPRX_Pos)                 /* (ETH_IER) PCS Link Partner Page Received Mask */
#define ETH_IER_LPPRX(value)                  (ETH_IER_LPPRX_Msk & (_UINT32_(value) << ETH_IER_LPPRX_Pos)) /* Assignment of value for LPPRX in the ETH_IER register */
#define ETH_IER_DRQFR_Pos                     _UINT32_(18)                                         /* (ETH_IER) PTP Delay Request Frame Received Position */
#define ETH_IER_DRQFR_Msk                     (_UINT32_(0x1) << ETH_IER_DRQFR_Pos)                 /* (ETH_IER) PTP Delay Request Frame Received Mask */
#define ETH_IER_DRQFR(value)                  (ETH_IER_DRQFR_Msk & (_UINT32_(value) << ETH_IER_DRQFR_Pos)) /* Assignment of value for DRQFR in the ETH_IER register */
#define ETH_IER_SFR_Pos                       _UINT32_(19)                                         /* (ETH_IER) PTP Sync Frame Received Position */
#define ETH_IER_SFR_Msk                       (_UINT32_(0x1) << ETH_IER_SFR_Pos)                   /* (ETH_IER) PTP Sync Frame Received Mask */
#define ETH_IER_SFR(value)                    (ETH_IER_SFR_Msk & (_UINT32_(value) << ETH_IER_SFR_Pos)) /* Assignment of value for SFR in the ETH_IER register */
#define ETH_IER_DRQFT_Pos                     _UINT32_(20)                                         /* (ETH_IER) PTP Delay Request Frame Transmitted Position */
#define ETH_IER_DRQFT_Msk                     (_UINT32_(0x1) << ETH_IER_DRQFT_Pos)                 /* (ETH_IER) PTP Delay Request Frame Transmitted Mask */
#define ETH_IER_DRQFT(value)                  (ETH_IER_DRQFT_Msk & (_UINT32_(value) << ETH_IER_DRQFT_Pos)) /* Assignment of value for DRQFT in the ETH_IER register */
#define ETH_IER_SFT_Pos                       _UINT32_(21)                                         /* (ETH_IER) PTP Sync Frame Transmitted Position */
#define ETH_IER_SFT_Msk                       (_UINT32_(0x1) << ETH_IER_SFT_Pos)                   /* (ETH_IER) PTP Sync Frame Transmitted Mask */
#define ETH_IER_SFT(value)                    (ETH_IER_SFT_Msk & (_UINT32_(value) << ETH_IER_SFT_Pos)) /* Assignment of value for SFT in the ETH_IER register */
#define ETH_IER_PDRQFR_Pos                    _UINT32_(22)                                         /* (ETH_IER) PDelay Request Frame Received Position */
#define ETH_IER_PDRQFR_Msk                    (_UINT32_(0x1) << ETH_IER_PDRQFR_Pos)                /* (ETH_IER) PDelay Request Frame Received Mask */
#define ETH_IER_PDRQFR(value)                 (ETH_IER_PDRQFR_Msk & (_UINT32_(value) << ETH_IER_PDRQFR_Pos)) /* Assignment of value for PDRQFR in the ETH_IER register */
#define ETH_IER_PDRSFR_Pos                    _UINT32_(23)                                         /* (ETH_IER) PDelay Response Frame Received Position */
#define ETH_IER_PDRSFR_Msk                    (_UINT32_(0x1) << ETH_IER_PDRSFR_Pos)                /* (ETH_IER) PDelay Response Frame Received Mask */
#define ETH_IER_PDRSFR(value)                 (ETH_IER_PDRSFR_Msk & (_UINT32_(value) << ETH_IER_PDRSFR_Pos)) /* Assignment of value for PDRSFR in the ETH_IER register */
#define ETH_IER_PDRQFT_Pos                    _UINT32_(24)                                         /* (ETH_IER) PDelay Request Frame Transmitted Position */
#define ETH_IER_PDRQFT_Msk                    (_UINT32_(0x1) << ETH_IER_PDRQFT_Pos)                /* (ETH_IER) PDelay Request Frame Transmitted Mask */
#define ETH_IER_PDRQFT(value)                 (ETH_IER_PDRQFT_Msk & (_UINT32_(value) << ETH_IER_PDRQFT_Pos)) /* Assignment of value for PDRQFT in the ETH_IER register */
#define ETH_IER_PDRSFT_Pos                    _UINT32_(25)                                         /* (ETH_IER) PDelay Response Frame Transmitted Position */
#define ETH_IER_PDRSFT_Msk                    (_UINT32_(0x1) << ETH_IER_PDRSFT_Pos)                /* (ETH_IER) PDelay Response Frame Transmitted Mask */
#define ETH_IER_PDRSFT(value)                 (ETH_IER_PDRSFT_Msk & (_UINT32_(value) << ETH_IER_PDRSFT_Pos)) /* Assignment of value for PDRSFT in the ETH_IER register */
#define ETH_IER_SRI_Pos                       _UINT32_(26)                                         /* (ETH_IER) TSU Seconds Register Increment Position */
#define ETH_IER_SRI_Msk                       (_UINT32_(0x1) << ETH_IER_SRI_Pos)                   /* (ETH_IER) TSU Seconds Register Increment Mask */
#define ETH_IER_SRI(value)                    (ETH_IER_SRI_Msk & (_UINT32_(value) << ETH_IER_SRI_Pos)) /* Assignment of value for SRI in the ETH_IER register */
#define ETH_IER_LPIRX_Pos                     _UINT32_(27)                                         /* (ETH_IER) Receive LPI Indication Position */
#define ETH_IER_LPIRX_Msk                     (_UINT32_(0x1) << ETH_IER_LPIRX_Pos)                 /* (ETH_IER) Receive LPI Indication Mask */
#define ETH_IER_LPIRX(value)                  (ETH_IER_LPIRX_Msk & (_UINT32_(value) << ETH_IER_LPIRX_Pos)) /* Assignment of value for LPIRX in the ETH_IER register */
#define ETH_IER_WOL_Pos                       _UINT32_(28)                                         /* (ETH_IER) Wake On LAN Position */
#define ETH_IER_WOL_Msk                       (_UINT32_(0x1) << ETH_IER_WOL_Pos)                   /* (ETH_IER) Wake On LAN Mask */
#define ETH_IER_WOL(value)                    (ETH_IER_WOL_Msk & (_UINT32_(value) << ETH_IER_WOL_Pos)) /* Assignment of value for WOL in the ETH_IER register */
#define ETH_IER_TSUCMP_Pos                    _UINT32_(29)                                         /* (ETH_IER) Tsu timer comparison Position */
#define ETH_IER_TSUCMP_Msk                    (_UINT32_(0x1) << ETH_IER_TSUCMP_Pos)                /* (ETH_IER) Tsu timer comparison Mask */
#define ETH_IER_TSUCMP(value)                 (ETH_IER_TSUCMP_Msk & (_UINT32_(value) << ETH_IER_TSUCMP_Pos)) /* Assignment of value for TSUCMP in the ETH_IER register */
#define ETH_IER_Msk                           _UINT32_(0x3FFFFEFF)                                 /* (ETH_IER) Register Mask  */


