zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/component/eth.h
/* -------- ETH_RPQ : (ETH Offset: 0x1038) ( R/ 32) Received Pause Quantum Register -------- */
#define ETH_RPQ_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_RPQ) Received Pause Quantum Register  Reset Value */

#define ETH_RPQ_RPQ_Pos                       _UINT32_(0)                                          /* (ETH_RPQ) Received Pause Quantum Position */
#define ETH_RPQ_RPQ_Msk                       (_UINT32_(0xFFFF) << ETH_RPQ_RPQ_Pos)                /* (ETH_RPQ) Received Pause Quantum Mask */
#define ETH_RPQ_RPQ(value)                    (ETH_RPQ_RPQ_Msk & (_UINT32_(value) << ETH_RPQ_RPQ_Pos)) /* Assignment of value for RPQ in the ETH_RPQ register */
#define ETH_RPQ_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_RPQ) Register Mask  */


/* -------- ETH_TPQ : (ETH Offset: 0x103C) (R/W 32) Transmit Pause Quantum Register -------- */
#define ETH_TPQ_RESETVALUE                    _UINT32_(0xFFFF)                                     /*  (ETH_TPQ) Transmit Pause Quantum Register  Reset Value */

#define ETH_TPQ_TPQ_Pos                       _UINT32_(0)                                          /* (ETH_TPQ) Transmit Pause Quantum Position */
#define ETH_TPQ_TPQ_Msk                       (_UINT32_(0xFFFF) << ETH_TPQ_TPQ_Pos)                /* (ETH_TPQ) Transmit Pause Quantum Mask */
#define ETH_TPQ_TPQ(value)                    (ETH_TPQ_TPQ_Msk & (_UINT32_(value) << ETH_TPQ_TPQ_Pos)) /* Assignment of value for TPQ in the ETH_TPQ register */
#define ETH_TPQ_TPQP1_Pos                     _UINT32_(16)                                         /* (ETH_TPQ) Transmit Pause Quantum Position */
#define ETH_TPQ_TPQP1_Msk                     (_UINT32_(0xFFFF) << ETH_TPQ_TPQP1_Pos)              /* (ETH_TPQ) Transmit Pause Quantum Mask */
#define ETH_TPQ_TPQP1(value)                  (ETH_TPQ_TPQP1_Msk & (_UINT32_(value) << ETH_TPQ_TPQP1_Pos)) /* Assignment of value for TPQP1 in the ETH_TPQ register */
#define ETH_TPQ_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_TPQ) Register Mask  */


/* -------- ETH_TPSF : (ETH Offset: 0x1040) (R/W 32) TX partial store and forward Register -------- */
#define ETH_TPSF_RESETVALUE                   _UINT32_(0x3FFF)                                     /*  (ETH_TPSF) TX partial store and forward Register  Reset Value */

#define ETH_TPSF_TPB1ADR_Pos                  _UINT32_(0)                                          /* (ETH_TPSF) TX packet buffer address Position */
#define ETH_TPSF_TPB1ADR_Msk                  (_UINT32_(0x3FFF) << ETH_TPSF_TPB1ADR_Pos)           /* (ETH_TPSF) TX packet buffer address Mask */
#define ETH_TPSF_TPB1ADR(value)               (ETH_TPSF_TPB1ADR_Msk & (_UINT32_(value) << ETH_TPSF_TPB1ADR_Pos)) /* Assignment of value for TPB1ADR in the ETH_TPSF register */
#define ETH_TPSF_ENTXP_Pos                    _UINT32_(31)                                         /* (ETH_TPSF) Enable TX partial store and forward operation Position */
#define ETH_TPSF_ENTXP_Msk                    (_UINT32_(0x1) << ETH_TPSF_ENTXP_Pos)                /* (ETH_TPSF) Enable TX partial store and forward operation Mask */
#define ETH_TPSF_ENTXP(value)                 (ETH_TPSF_ENTXP_Msk & (_UINT32_(value) << ETH_TPSF_ENTXP_Pos)) /* Assignment of value for ENTXP in the ETH_TPSF register */
#define ETH_TPSF_Msk                          _UINT32_(0x80003FFF)                                 /* (ETH_TPSF) Register Mask  */


/* -------- ETH_RPSF : (ETH Offset: 0x1044) (R/W 32) RX partial store and forward Register -------- */
#define ETH_RPSF_RESETVALUE                   _UINT32_(0x7FF)                                      /*  (ETH_RPSF) RX partial store and forward Register  Reset Value */

#define ETH_RPSF_RPB1ADR_Pos                  _UINT32_(0)                                          /* (ETH_RPSF) RX packet buffer address Position */
#define ETH_RPSF_RPB1ADR_Msk                  (_UINT32_(0x7FF) << ETH_RPSF_RPB1ADR_Pos)            /* (ETH_RPSF) RX packet buffer address Mask */
#define ETH_RPSF_RPB1ADR(value)               (ETH_RPSF_RPB1ADR_Msk & (_UINT32_(value) << ETH_RPSF_RPB1ADR_Pos)) /* Assignment of value for RPB1ADR in the ETH_RPSF register */
#define ETH_RPSF_ENRXP_Pos                    _UINT32_(31)                                         /* (ETH_RPSF) Enable RX partial store and forward operation Position */
#define ETH_RPSF_ENRXP_Msk                    (_UINT32_(0x1) << ETH_RPSF_ENRXP_Pos)                /* (ETH_RPSF) Enable RX partial store and forward operation Mask */
#define ETH_RPSF_ENRXP(value)                 (ETH_RPSF_ENRXP_Msk & (_UINT32_(value) << ETH_RPSF_ENRXP_Pos)) /* Assignment of value for ENRXP in the ETH_RPSF register */
#define ETH_RPSF_Msk                          _UINT32_(0x800007FF)                                 /* (ETH_RPSF) Register Mask  */


/* -------- ETH_RJFML : (ETH Offset: 0x1048) (R/W 32) RX Jumbo Frame Max Length Register -------- */
#define ETH_RJFML_RESETVALUE                  _UINT32_(0x2800)                                     /*  (ETH_RJFML) RX Jumbo Frame Max Length Register  Reset Value */

#define ETH_RJFML_FML_Pos                     _UINT32_(0)                                          /* (ETH_RJFML) Frame Max Length Position */
#define ETH_RJFML_FML_Msk                     (_UINT32_(0x3FFF) << ETH_RJFML_FML_Pos)              /* (ETH_RJFML) Frame Max Length Mask */
#define ETH_RJFML_FML(value)                  (ETH_RJFML_FML_Msk & (_UINT32_(value) << ETH_RJFML_FML_Pos)) /* Assignment of value for FML in the ETH_RJFML register */
#define ETH_RJFML_Msk                         _UINT32_(0x00003FFF)                                 /* (ETH_RJFML) Register Mask  */


/* -------- ETH_EFIEN : (ETH Offset: 0x104C) (R/W 32) External FIFO Interface Enable -------- */
#define ETH_EFIEN_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFIEN) External FIFO Interface Enable  Reset Value */

#define ETH_EFIEN_EFIEN_Pos                   _UINT32_(0)                                          /* (ETH_EFIEN) Enable external fifo interface Position */
#define ETH_EFIEN_EFIEN_Msk                   (_UINT32_(0x1) << ETH_EFIEN_EFIEN_Pos)               /* (ETH_EFIEN) Enable external fifo interface Mask */
#define ETH_EFIEN_EFIEN(value)                (ETH_EFIEN_EFIEN_Msk & (_UINT32_(value) << ETH_EFIEN_EFIEN_Pos)) /* Assignment of value for EFIEN in the ETH_EFIEN register */
#define ETH_EFIEN_Msk                         _UINT32_(0x00000001)                                 /* (ETH_EFIEN) Register Mask  */


