zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/component/eth.h
#define ETH_FT_FTX_Pos                        _UINT32_(0)                                          /* (ETH_FT) Frames Transmitted without Error Position */
#define ETH_FT_FTX_Msk                        (_UINT32_(0xFFFFFFFF) << ETH_FT_FTX_Pos)             /* (ETH_FT) Frames Transmitted without Error Mask */
#define ETH_FT_FTX(value)                     (ETH_FT_FTX_Msk & (_UINT32_(value) << ETH_FT_FTX_Pos)) /* Assignment of value for FTX in the ETH_FT register */
#define ETH_FT_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (ETH_FT) Register Mask  */


/* -------- ETH_BCFT : (ETH Offset: 0x110C) (R/W 32) Broadcast Frames Transmitted Register -------- */
#define ETH_BCFT_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_BCFT) Broadcast Frames Transmitted Register  Reset Value */

#define ETH_BCFT_BFTX_Pos                     _UINT32_(0)                                          /* (ETH_BCFT) Broadcast Frames Transmitted without Error Position */
#define ETH_BCFT_BFTX_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_BCFT_BFTX_Pos)          /* (ETH_BCFT) Broadcast Frames Transmitted without Error Mask */
#define ETH_BCFT_BFTX(value)                  (ETH_BCFT_BFTX_Msk & (_UINT32_(value) << ETH_BCFT_BFTX_Pos)) /* Assignment of value for BFTX in the ETH_BCFT register */
#define ETH_BCFT_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_BCFT) Register Mask  */


/* -------- ETH_MFT : (ETH Offset: 0x1110) (R/W 32) Multicast Frames Transmitted Register -------- */
#define ETH_MFT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MFT) Multicast Frames Transmitted Register  Reset Value */

#define ETH_MFT_MFTX_Pos                      _UINT32_(0)                                          /* (ETH_MFT) Multicast Frames Transmitted without Error Position */
#define ETH_MFT_MFTX_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_MFT_MFTX_Pos)           /* (ETH_MFT) Multicast Frames Transmitted without Error Mask */
#define ETH_MFT_MFTX(value)                   (ETH_MFT_MFTX_Msk & (_UINT32_(value) << ETH_MFT_MFTX_Pos)) /* Assignment of value for MFTX in the ETH_MFT register */
#define ETH_MFT_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_MFT) Register Mask  */


/* -------- ETH_PFT : (ETH Offset: 0x1114) (R/W 32) Pause Frames Transmitted Register -------- */
#define ETH_PFT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_PFT) Pause Frames Transmitted Register  Reset Value */

#define ETH_PFT_PFTX_Pos                      _UINT32_(0)                                          /* (ETH_PFT) Pause Frames Transmitted Register Position */
#define ETH_PFT_PFTX_Msk                      (_UINT32_(0xFFFF) << ETH_PFT_PFTX_Pos)               /* (ETH_PFT) Pause Frames Transmitted Register Mask */
#define ETH_PFT_PFTX(value)                   (ETH_PFT_PFTX_Msk & (_UINT32_(value) << ETH_PFT_PFTX_Pos)) /* Assignment of value for PFTX in the ETH_PFT register */
#define ETH_PFT_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_PFT) Register Mask  */


/* -------- ETH_BFT64 : (ETH Offset: 0x1118) (R/W 32) 64 Byte Frames Transmitted Register -------- */
#define ETH_BFT64_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_BFT64) 64 Byte Frames Transmitted Register  Reset Value */

#define ETH_BFT64_NFTX_Pos                    _UINT32_(0)                                          /* (ETH_BFT64) 64 Byte Frames Transmitted without Error Position */
#define ETH_BFT64_NFTX_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_BFT64_NFTX_Pos)         /* (ETH_BFT64) 64 Byte Frames Transmitted without Error Mask */
#define ETH_BFT64_NFTX(value)                 (ETH_BFT64_NFTX_Msk & (_UINT32_(value) << ETH_BFT64_NFTX_Pos)) /* Assignment of value for NFTX in the ETH_BFT64 register */
#define ETH_BFT64_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_BFT64) Register Mask  */


/* -------- ETH_TBFT127 : (ETH Offset: 0x111C) (R/W 32) 65 to 127 Byte Frames Transmitted Register -------- */
#define ETH_TBFT127_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFT127) 65 to 127 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT127_NFTX_Pos                  _UINT32_(0)                                          /* (ETH_TBFT127) 65 to 127 Byte Frames Transmitted without Error Position */
#define ETH_TBFT127_NFTX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFT127_NFTX_Pos)       /* (ETH_TBFT127) 65 to 127 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT127_NFTX(value)               (ETH_TBFT127_NFTX_Msk & (_UINT32_(value) << ETH_TBFT127_NFTX_Pos)) /* Assignment of value for NFTX in the ETH_TBFT127 register */
#define ETH_TBFT127_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT127) Register Mask  */


/* -------- ETH_TBFT255 : (ETH Offset: 0x1120) (R/W 32) 128 to 255 Byte Frames Transmitted Register -------- */
#define ETH_TBFT255_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFT255) 128 to 255 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT255_NFTX_Pos                  _UINT32_(0)                                          /* (ETH_TBFT255) 128 to 255 Byte Frames Transmitted without Error Position */
#define ETH_TBFT255_NFTX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFT255_NFTX_Pos)       /* (ETH_TBFT255) 128 to 255 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT255_NFTX(value)               (ETH_TBFT255_NFTX_Msk & (_UINT32_(value) << ETH_TBFT255_NFTX_Pos)) /* Assignment of value for NFTX in the ETH_TBFT255 register */
#define ETH_TBFT255_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT255) Register Mask  */


/* -------- ETH_TBFT511 : (ETH Offset: 0x1124) (R/W 32) 256 to 511 Byte Frames Transmitted Register -------- */
#define ETH_TBFT511_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFT511) 256 to 511 Byte Frames Transmitted Register  Reset Value */

