zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/component/eth.h
/* -------- ETH_IERQU : (ETH Offset: 0x1660) (R/W 32) Interrupt Enable Queue N (upper) -------- */
#define ETH_IERQU_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_IERQU) Interrupt Enable Queue N (upper)  Reset Value */

#define ETH_IERQU_RCOMP_Pos                   _UINT32_(1)                                          /* (ETH_IERQU) Receive Complete Position */
#define ETH_IERQU_RCOMP_Msk                   (_UINT32_(0x1) << ETH_IERQU_RCOMP_Pos)               /* (ETH_IERQU) Receive Complete Mask */
#define ETH_IERQU_RCOMP(value)                (ETH_IERQU_RCOMP_Msk & (_UINT32_(value) << ETH_IERQU_RCOMP_Pos)) /* Assignment of value for RCOMP in the ETH_IERQU register */
#define ETH_IERQU_RXUBR_Pos                   _UINT32_(2)                                          /* (ETH_IERQU) RX Used Bit Read Position */
#define ETH_IERQU_RXUBR_Msk                   (_UINT32_(0x1) << ETH_IERQU_RXUBR_Pos)               /* (ETH_IERQU) RX Used Bit Read Mask */
#define ETH_IERQU_RXUBR(value)                (ETH_IERQU_RXUBR_Msk & (_UINT32_(value) << ETH_IERQU_RXUBR_Pos)) /* Assignment of value for RXUBR in the ETH_IERQU register */
#define ETH_IERQU_TXUBR_Pos                   _UINT32_(3)                                          /* (ETH_IERQU) TX Used Bit Read Position */
#define ETH_IERQU_TXUBR_Msk                   (_UINT32_(0x1) << ETH_IERQU_TXUBR_Pos)               /* (ETH_IERQU) TX Used Bit Read Mask */
#define ETH_IERQU_TXUBR(value)                (ETH_IERQU_TXUBR_Msk & (_UINT32_(value) << ETH_IERQU_TXUBR_Pos)) /* Assignment of value for TXUBR in the ETH_IERQU register */
#define ETH_IERQU_TUR_Pos                     _UINT32_(4)                                          /* (ETH_IERQU) Transmit Underrun Position */
#define ETH_IERQU_TUR_Msk                     (_UINT32_(0x1) << ETH_IERQU_TUR_Pos)                 /* (ETH_IERQU) Transmit Underrun Mask */
#define ETH_IERQU_TUR(value)                  (ETH_IERQU_TUR_Msk & (_UINT32_(value) << ETH_IERQU_TUR_Pos)) /* Assignment of value for TUR in the ETH_IERQU register */
#define ETH_IERQU_RLEX_Pos                    _UINT32_(5)                                          /* (ETH_IERQU) Retry Limit Exceeded Position */
#define ETH_IERQU_RLEX_Msk                    (_UINT32_(0x1) << ETH_IERQU_RLEX_Pos)                /* (ETH_IERQU) Retry Limit Exceeded Mask */
#define ETH_IERQU_RLEX(value)                 (ETH_IERQU_RLEX_Msk & (_UINT32_(value) << ETH_IERQU_RLEX_Pos)) /* Assignment of value for RLEX in the ETH_IERQU register */
#define ETH_IERQU_TFC_Pos                     _UINT32_(6)                                          /* (ETH_IERQU) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IERQU_TFC_Msk                     (_UINT32_(0x1) << ETH_IERQU_TFC_Pos)                 /* (ETH_IERQU) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IERQU_TFC(value)                  (ETH_IERQU_TFC_Msk & (_UINT32_(value) << ETH_IERQU_TFC_Pos)) /* Assignment of value for TFC in the ETH_IERQU register */
#define ETH_IERQU_TCOMP_Pos                   _UINT32_(7)                                          /* (ETH_IERQU) Transmit Complete Position */
#define ETH_IERQU_TCOMP_Msk                   (_UINT32_(0x1) << ETH_IERQU_TCOMP_Pos)               /* (ETH_IERQU) Transmit Complete Mask */
#define ETH_IERQU_TCOMP(value)                (ETH_IERQU_TCOMP_Msk & (_UINT32_(value) << ETH_IERQU_TCOMP_Pos)) /* Assignment of value for TCOMP in the ETH_IERQU register */
#define ETH_IERQU_ROVR_Pos                    _UINT32_(10)                                         /* (ETH_IERQU) Receive Overrun Position */
#define ETH_IERQU_ROVR_Msk                    (_UINT32_(0x1) << ETH_IERQU_ROVR_Pos)                /* (ETH_IERQU) Receive Overrun Mask */
#define ETH_IERQU_ROVR(value)                 (ETH_IERQU_ROVR_Msk & (_UINT32_(value) << ETH_IERQU_ROVR_Pos)) /* Assignment of value for ROVR in the ETH_IERQU register */
#define ETH_IERQU_HRESP_Pos                   _UINT32_(11)                                         /* (ETH_IERQU) HRESP Not OK Position */
#define ETH_IERQU_HRESP_Msk                   (_UINT32_(0x1) << ETH_IERQU_HRESP_Pos)               /* (ETH_IERQU) HRESP Not OK Mask */
#define ETH_IERQU_HRESP(value)                (ETH_IERQU_HRESP_Msk & (_UINT32_(value) << ETH_IERQU_HRESP_Pos)) /* Assignment of value for HRESP in the ETH_IERQU register */
#define ETH_IERQU_Msk                         _UINT32_(0x00000CFE)                                 /* (ETH_IERQU) Register Mask  */


/* -------- ETH_IDRQU : (ETH Offset: 0x1680) (R/W 32) Interrupt Disable Queue N (upper) -------- */
#define ETH_IDRQU_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_IDRQU) Interrupt Disable Queue N (upper)  Reset Value */

#define ETH_IDRQU_RCOMP_Pos                   _UINT32_(1)                                          /* (ETH_IDRQU) Receive Complete Position */
#define ETH_IDRQU_RCOMP_Msk                   (_UINT32_(0x1) << ETH_IDRQU_RCOMP_Pos)               /* (ETH_IDRQU) Receive Complete Mask */
#define ETH_IDRQU_RCOMP(value)                (ETH_IDRQU_RCOMP_Msk & (_UINT32_(value) << ETH_IDRQU_RCOMP_Pos)) /* Assignment of value for RCOMP in the ETH_IDRQU register */
#define ETH_IDRQU_RXUBR_Pos                   _UINT32_(2)                                          /* (ETH_IDRQU) RX Used Bit Read Position */
#define ETH_IDRQU_RXUBR_Msk                   (_UINT32_(0x1) << ETH_IDRQU_RXUBR_Pos)               /* (ETH_IDRQU) RX Used Bit Read Mask */
#define ETH_IDRQU_RXUBR(value)                (ETH_IDRQU_RXUBR_Msk & (_UINT32_(value) << ETH_IDRQU_RXUBR_Pos)) /* Assignment of value for RXUBR in the ETH_IDRQU register */
#define ETH_IDRQU_TXUBR_Pos                   _UINT32_(3)                                          /* (ETH_IDRQU) TX Used Bit Read Position */
#define ETH_IDRQU_TXUBR_Msk                   (_UINT32_(0x1) << ETH_IDRQU_TXUBR_Pos)               /* (ETH_IDRQU) TX Used Bit Read Mask */
#define ETH_IDRQU_TXUBR(value)                (ETH_IDRQU_TXUBR_Msk & (_UINT32_(value) << ETH_IDRQU_TXUBR_Pos)) /* Assignment of value for TXUBR in the ETH_IDRQU register */
#define ETH_IDRQU_TUR_Pos                     _UINT32_(4)                                          /* (ETH_IDRQU) Transmit Underrun Position */
#define ETH_IDRQU_TUR_Msk                     (_UINT32_(0x1) << ETH_IDRQU_TUR_Pos)                 /* (ETH_IDRQU) Transmit Underrun Mask */
#define ETH_IDRQU_TUR(value)                  (ETH_IDRQU_TUR_Msk & (_UINT32_(value) << ETH_IDRQU_TUR_Pos)) /* Assignment of value for TUR in the ETH_IDRQU register */
#define ETH_IDRQU_RLEX_Pos                    _UINT32_(5)                                          /* (ETH_IDRQU) Retry Limit Exceeded Position */
#define ETH_IDRQU_RLEX_Msk                    (_UINT32_(0x1) << ETH_IDRQU_RLEX_Pos)                /* (ETH_IDRQU) Retry Limit Exceeded Mask */
#define ETH_IDRQU_RLEX(value)                 (ETH_IDRQU_RLEX_Msk & (_UINT32_(value) << ETH_IDRQU_RLEX_Pos)) /* Assignment of value for RLEX in the ETH_IDRQU register */
#define ETH_IDRQU_TFC_Pos                     _UINT32_(6)                                          /* (ETH_IDRQU) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IDRQU_TFC_Msk                     (_UINT32_(0x1) << ETH_IDRQU_TFC_Pos)                 /* (ETH_IDRQU) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IDRQU_TFC(value)                  (ETH_IDRQU_TFC_Msk & (_UINT32_(value) << ETH_IDRQU_TFC_Pos)) /* Assignment of value for TFC in the ETH_IDRQU register */
#define ETH_IDRQU_TCOMP_Pos                   _UINT32_(7)                                          /* (ETH_IDRQU) Transmit Complete Position */
#define ETH_IDRQU_TCOMP_Msk                   (_UINT32_(0x1) << ETH_IDRQU_TCOMP_Pos)               /* (ETH_IDRQU) Transmit Complete Mask */
#define ETH_IDRQU_TCOMP(value)                (ETH_IDRQU_TCOMP_Msk & (_UINT32_(value) << ETH_IDRQU_TCOMP_Pos)) /* Assignment of value for TCOMP in the ETH_IDRQU register */
#define ETH_IDRQU_ROVR_Pos                    _UINT32_(10)                                         /* (ETH_IDRQU) Receive Overrun Position */
#define ETH_IDRQU_ROVR_Msk                    (_UINT32_(0x1) << ETH_IDRQU_ROVR_Pos)                /* (ETH_IDRQU) Receive Overrun Mask */
#define ETH_IDRQU_ROVR(value)                 (ETH_IDRQU_ROVR_Msk & (_UINT32_(value) << ETH_IDRQU_ROVR_Pos)) /* Assignment of value for ROVR in the ETH_IDRQU register */
#define ETH_IDRQU_HRESP_Pos                   _UINT32_(11)                                         /* (ETH_IDRQU) HRESP Not OK Position */
#define ETH_IDRQU_HRESP_Msk                   (_UINT32_(0x1) << ETH_IDRQU_HRESP_Pos)               /* (ETH_IDRQU) HRESP Not OK Mask */
#define ETH_IDRQU_HRESP(value)                (ETH_IDRQU_HRESP_Msk & (_UINT32_(value) << ETH_IDRQU_HRESP_Pos)) /* Assignment of value for HRESP in the ETH_IDRQU register */
#define ETH_IDRQU_Msk                         _UINT32_(0x00000CFE)                                 /* (ETH_IDRQU) Register Mask  */


/* -------- ETH_IMRQU : (ETH Offset: 0x16A0) (R/W 32) Interrupt Mask Queue N (upper) -------- */
#define ETH_IMRQU_RESETVALUE                  _UINT32_(0x876)                                      /*  (ETH_IMRQU) Interrupt Mask Queue N (upper)  Reset Value */

#define ETH_IMRQU_RCOMP_Pos                   _UINT32_(1)                                          /* (ETH_IMRQU) Receive Complete Position */
#define ETH_IMRQU_RCOMP_Msk                   (_UINT32_(0x1) << ETH_IMRQU_RCOMP_Pos)               /* (ETH_IMRQU) Receive Complete Mask */
#define ETH_IMRQU_RCOMP(value)                (ETH_IMRQU_RCOMP_Msk & (_UINT32_(value) << ETH_IMRQU_RCOMP_Pos)) /* Assignment of value for RCOMP in the ETH_IMRQU register */
#define ETH_IMRQU_RXUBR_Pos                   _UINT32_(2)                                          /* (ETH_IMRQU) RX Used Bit Read Position */
#define ETH_IMRQU_RXUBR_Msk                   (_UINT32_(0x1) << ETH_IMRQU_RXUBR_Pos)               /* (ETH_IMRQU) RX Used Bit Read Mask */
#define ETH_IMRQU_RXUBR(value)                (ETH_IMRQU_RXUBR_Msk & (_UINT32_(value) << ETH_IMRQU_RXUBR_Pos)) /* Assignment of value for RXUBR in the ETH_IMRQU register */
#define ETH_IMRQU_TXUBR_Pos                   _UINT32_(3)                                          /* (ETH_IMRQU) TX Used Bit Read Position */
#define ETH_IMRQU_TXUBR_Msk                   (_UINT32_(0x1) << ETH_IMRQU_TXUBR_Pos)               /* (ETH_IMRQU) TX Used Bit Read Mask */
#define ETH_IMRQU_TXUBR(value)                (ETH_IMRQU_TXUBR_Msk & (_UINT32_(value) << ETH_IMRQU_TXUBR_Pos)) /* Assignment of value for TXUBR in the ETH_IMRQU register */
#define ETH_IMRQU_TUR_Pos                     _UINT32_(4)                                          /* (ETH_IMRQU) Transmit Underrun Position */
#define ETH_IMRQU_TUR_Msk                     (_UINT32_(0x1) << ETH_IMRQU_TUR_Pos)                 /* (ETH_IMRQU) Transmit Underrun Mask */
#define ETH_IMRQU_TUR(value)                  (ETH_IMRQU_TUR_Msk & (_UINT32_(value) << ETH_IMRQU_TUR_Pos)) /* Assignment of value for TUR in the ETH_IMRQU register */
#define ETH_IMRQU_RLEX_Pos                    _UINT32_(5)                                          /* (ETH_IMRQU) Retry Limit Exceeded Position */
#define ETH_IMRQU_RLEX_Msk                    (_UINT32_(0x1) << ETH_IMRQU_RLEX_Pos)                /* (ETH_IMRQU) Retry Limit Exceeded Mask */
#define ETH_IMRQU_RLEX(value)                 (ETH_IMRQU_RLEX_Msk & (_UINT32_(value) << ETH_IMRQU_RLEX_Pos)) /* Assignment of value for RLEX in the ETH_IMRQU register */
#define ETH_IMRQU_TFC_Pos                     _UINT32_(6)                                          /* (ETH_IMRQU) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IMRQU_TFC_Msk                     (_UINT32_(0x1) << ETH_IMRQU_TFC_Pos)                 /* (ETH_IMRQU) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IMRQU_TFC(value)                  (ETH_IMRQU_TFC_Msk & (_UINT32_(value) << ETH_IMRQU_TFC_Pos)) /* Assignment of value for TFC in the ETH_IMRQU register */
#define ETH_IMRQU_TCOMP_Pos                   _UINT32_(7)                                          /* (ETH_IMRQU) Transmit Complete Position */
#define ETH_IMRQU_TCOMP_Msk                   (_UINT32_(0x1) << ETH_IMRQU_TCOMP_Pos)               /* (ETH_IMRQU) Transmit Complete Mask */
#define ETH_IMRQU_TCOMP(value)                (ETH_IMRQU_TCOMP_Msk & (_UINT32_(value) << ETH_IMRQU_TCOMP_Pos)) /* Assignment of value for TCOMP in the ETH_IMRQU register */
#define ETH_IMRQU_ROVR_Pos                    _UINT32_(10)                                         /* (ETH_IMRQU) Receive Overrun Position */
#define ETH_IMRQU_ROVR_Msk                    (_UINT32_(0x1) << ETH_IMRQU_ROVR_Pos)                /* (ETH_IMRQU) Receive Overrun Mask */
#define ETH_IMRQU_ROVR(value)                 (ETH_IMRQU_ROVR_Msk & (_UINT32_(value) << ETH_IMRQU_ROVR_Pos)) /* Assignment of value for ROVR in the ETH_IMRQU register */
#define ETH_IMRQU_HRESP_Pos                   _UINT32_(11)                                         /* (ETH_IMRQU) HRESP Not OK Position */
#define ETH_IMRQU_HRESP_Msk                   (_UINT32_(0x1) << ETH_IMRQU_HRESP_Pos)               /* (ETH_IMRQU) HRESP Not OK Mask */
#define ETH_IMRQU_HRESP(value)                (ETH_IMRQU_HRESP_Msk & (_UINT32_(value) << ETH_IMRQU_HRESP_Pos)) /* Assignment of value for HRESP in the ETH_IMRQU register */
#define ETH_IMRQU_Msk                         _UINT32_(0x00000CFE)                                 /* (ETH_IMRQU) Register Mask  */


/* -------- ETH_SCRT2ET : (ETH Offset: 0x16E0) (R/W 32) Screening Type 2 EtherType Register -------- */
#define ETH_SCRT2ET_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_SCRT2ET) Screening Type 2 EtherType Register  Reset Value */

#define ETH_SCRT2ET_CMPVAL_Pos                _UINT32_(0)                                          /* (ETH_SCRT2ET) Ethertype compare value Position */
#define ETH_SCRT2ET_CMPVAL_Msk                (_UINT32_(0xFFFF) << ETH_SCRT2ET_CMPVAL_Pos)         /* (ETH_SCRT2ET) Ethertype compare value Mask */
#define ETH_SCRT2ET_CMPVAL(value)             (ETH_SCRT2ET_CMPVAL_Msk & (_UINT32_(value) << ETH_SCRT2ET_CMPVAL_Pos)) /* Assignment of value for CMPVAL in the ETH_SCRT2ET register */
#define ETH_SCRT2ET_Msk                       _UINT32_(0x0000FFFF)                                 /* (ETH_SCRT2ET) Register Mask  */


